# Starbucks - Data Wrangling

    Udacity - Machine Learning Engineer Nanodegree Program
    Author: Leonardo Sim√µes
    
**In this step the data and datasets will be prepared, that is, collected, evaluated, cleaned and arranged so that they can be analyzed and applied in Machine Learning models.**

## Datasets

The data is contained in three files:

* portfolio.json - containing offer ids and meta data about each offer (duration, type, etc.)
* profile.json - demographic data for each customer
* transcript.json - records for transactions, offers received, offers viewed, and offers completed

Here is the schema and explanation of each variable in the files:

**portfolio.json**
* id (string) - offer id
* offer_type (string) - type of offer ie BOGO, discount, informational
* difficulty (int) - minimum required spend to complete an offer
* reward (int) - reward given for completing an offer
* duration (int) - time for offer to be open, in days
* channels (list of strings)

**profile.json**
* age (int) - age of the customer 
* became_member_on (int) - date when customer created an app account
* gender (str) - gender of the customer (note some entries contain 'O' for other rather than M or F)
* id (str) - customer id
* income (float) - customer's income

**transcript.json**
* event (str) - record description (ie transaction, offer received, offer viewed, etc.)
* person (str) - customer id
* time (int) - time in hours since start of test. The data begins at time t=0
* value - (dict of strings) - either an offer id or transaction amount depending on the record

In [1]:
#imports
import math
import json
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

## Gather

In [2]:
# read in the json files
portfolio = pd.read_json('data/portfolio.json', orient='records', lines=True)
profile = pd.read_json('data/profile.json', orient='records', lines=True)
transcript = pd.read_json('data/transcript.json', orient='records', lines=True)

## Assessing

### portfolio

In [3]:
# Dataset dimensions
portfolio.shape

(10, 6)

In [4]:
# Visual check of the dataset
portfolio

,reward,channels,difficulty,duration,offer_type,id
0,10,"[email, mobile, social]",10,7,bogo,ae264e3637204a6fb9bb56bc8210ddfd
1,10,"[web, email, mobile, social]",10,5,bogo,4d5c57ea9a6940dd891ad53e9dbe8da0
2,0,"[web, email, mobile]",0,4,informational,3f207df678b143eea3cee63160fa8bed
3,5,"[web, email, mobile]",5,7,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9
4,5,"[web, email]",20,10,discount,0b1e1539f2cc45b7b9fa7c272da2e1d7
5,3,"[web, email, mobile, social]",7,7,discount,2298d6c36e964ae4a3e7e9706d1fb8c2
6,2,"[web, email, mobile, social]",10,10,discount,fafdcd668e3743c1bb461111dcafc2a4
7,0,"[email, mobile, social]",0,3,informational,5a8bc65990b245e5a138643cd4eb9837
8,5,"[web, email, mobile, social]",5,5,bogo,f19421c1d4aa40978ebb69ca19b0e20d
9,2,"[web, email, mobile]",10,7,discount,2906b810c7d4411798c6938adc9daaa5

In [5]:
portfolio.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   reward      10 non-null     int64
 1   channels    10 non-null     object
 2   difficulty  10 non-null     int64
 3   duration    10 non-null     int64
 4   offer_type  10 non-null     object
 5   id          10 non-null     object
dtypes: int64(3), object(3)
memory usage: 608.0+ bytes

In [6]:
portfolio.describe()

          reward  difficulty   duration
count  10.000000   10.000000  10.000000
mean    4.200000    7.700000   6.500000
std     3.583915    5.831905   2.321398
min     0.000000    0.000000   3.000000
25%     2.000000    5.000000   5.000000
50%     4.000000    8.500000   7.000000
75%     5.000000   10.000000   7.000000
max    10.000000   20.000000  10.000000

In [7]:
#Checking for null values
portfolio.isna().sum()

reward        0
channels      0
difficulty    0
duration      0
offer_type    0
id            0
dtype: int64

Problem:
* Multivalued 'channels' column.

### profile

In [8]:
#Dataset dimensions
profile.shape

(17000, 5)

In [9]:
# Visual check of the dataset
profile.head()

  gender  age                                id  became_member_on    income
0   None  118  68be06ca386d4c31939f3a4f0e3dd783          20170212       NaN
1      F   55  0610b486422d4921ae7d2bf64640c50b          20170715  112000.0
2   None  118  38fe809add3b4fcf9315a9694bb96ff5          20180712       NaN
3      F   75  78afa995795e4d85b5d9ceeca43f5fef          20170509  100000.0
4   None  118  a03223e636434f42ac4c3df47e8bac43          20170804       NaN

In [10]:
profile.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   gender            14825 non-null  object
 1   age               17000 non-null  int64
 2   id                17000 non-null  object
 3   became_member_on  17000 non-null  int64
 4   income            14825 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 664.2+ KB

In [11]:
profile.describe()

                age  became_member_on         income
count  17000.000000      1.700000e+04   14825.000000
mean      62.531412      2.016703e+07   65404.991568
std       26.738580      1.167750e+04   21598.299410
min       18.000000      2.013073e+07   30000.000000
25%       45.000000      2.016053e+07   49000.000000
50%       58.000000      2.017080e+07   64000.000000
75%       73.000000      2.017123e+07   80000.000000
max      118.000000      2.018073e+07  120000.000000

In [12]:
#Checking for null values
profile.isna().sum()

gender              2175
age                    0
id                     0
became_member_on       0
income              2175
dtype: int64

Problems:
  * The lines with null values for 'gender' and 'income' also present other problems, such as wrong age.

### transcript

In [13]:
# Dataset dimensions
transcript.shape

(306534, 4)

In [14]:
# Visual check of the dataset
transcript.head(10)

,person,event,value,time
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,{'offer id': '9b98b8c7a33c4b65b9aebfe6a799e6d9'},0
1,a03223e636434f42ac4c3df47e8bac43,offer received,{'offer id': '0b1e1539f2cc45b7b9fa7c272da2e1d7'},0
2,e2127556f4f64592b11af22de27a7932,offer received,{'offer id': '2906b810c7d4411798c6938adc9daaa5'},0
3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,{'offer id': 'fafdcd668e3743c1bb461111dcafc2a4'},0
4,68617ca6246f4fbc85e91a2a49552598,offer received,{'offer id': '4d5c57ea9a6940dd891ad53e9dbe8da0'},0
5,389bc3fa690240e798340f5a15918d5c,offer received,{'offer id': 'f19421c1d4aa40978ebb69ca19b0e20d'},0
6,c4863c7985cf408faee930f111475da3,offer received,{'offer id': '2298d6c36e964ae4a3e7e9706d1fb8c2'},0
7,2eeac8d8feae4a8cad5a6af0499a211d,offer received,{'offer id': '3f207df678b143eea3cee63160fa8bed'},0
8,aa4862eba776480b8bb9c68455b8c2e1,offer received,{'offer id': '0b1e1539f2cc45b7b9fa7c272da2e1d7'},0
9,31dda685af34476cad5bc968bdb01c53,offer received,{'offer id': '0b1e1539f2cc45b7b9fa7c272da2e1d7'},0

In [15]:
transcript.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 306534 entries, 0 to 306533
Data columns (total 4 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   person  306534 non-null  object
 1   event   306534 non-null  object
 2   value   306534 non-null  object
 3   time    306534 non-null  int64
dtypes: int64(1), object(3)
memory usage: 9.4+ MB

In [16]:
transcript.describe()

                time
count  306534.000000
mean      366.382940
std       200.326314
min         0.000000
25%       186.000000
50%       408.000000
75%       528.000000
max       714.000000

In [17]:
#Checking for null values
transcript.isna().sum()

person    0
event     0
value     0
time      0
dtype: int64

In [18]:
transcript.event.value_counts()

transaction        138953
offer received      76277
offer viewed        57725
offer completed     33579
Name: event, dtype: int64

Problems:

* The 'value' column is a string that must be formatted to match the offer id or the discount amount.
* There should be a column for the offer id and one for the discount amount.

## Clean

### portfolio

In [19]:
# Visual check of the dataset
portfolio.head()

,reward,channels,difficulty,duration,offer_type,id
0,10,"[email, mobile, social]",10,7,bogo,ae264e3637204a6fb9bb56bc8210ddfd
1,10,"[web, email, mobile, social]",10,5,bogo,4d5c57ea9a6940dd891ad53e9dbe8da0
2,0,"[web, email, mobile]",0,4,informational,3f207df678b143eea3cee63160fa8bed
3,5,"[web, email, mobile]",5,7,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9
4,5,"[web, email]",20,10,discount,0b1e1539f2cc45b7b9fa7c272da2e1d7

* Create columns for each of the possible 'channel' values
* Drop 'channels' column

In [20]:
type(portfolio['channels'].iloc[0])

list

In [21]:
portfolio['channels'] = portfolio['channels'].apply(lambda x: ','.join(map(str, x)))
channels = portfolio['channels'].str.get_dummies(',')
channels

   email  mobile  social  web
0      1       1       1    0
1      1       1       1    1
2      1       1       0    1
3      1       1       0    1
4      1       0       0    1
5      1       1       1    1
6      1       1       1    1
7      1       1       1    0
8      1       1       1    1
9      1       1       0    1

In [22]:
#Adding columns with the values of channels
portfolio = portfolio.merge(channels,left_index=True, right_index=True)
portfolio.head()

,reward,channels,difficulty,duration,offer_type,id,email,mobile,social,web
0,10,"email,mobile,social",10,7,bogo,ae264e3637204a6fb9bb56bc8210ddfd,1,1,1,0
1,10,"web,email,mobile,social",10,5,bogo,4d5c57ea9a6940dd891ad53e9dbe8da0,1,1,1,1
2,0,"web,email,mobile",0,4,informational,3f207df678b143eea3cee63160fa8bed,1,1,0,1
3,5,"web,email,mobile",5,7,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9,1,1,0,1
4,5,"web,email",20,10,discount,0b1e1539f2cc45b7b9fa7c272da2e1d7,1,0,0,1

In [23]:
portfolio.drop('channels', axis=1, inplace=True)

In [24]:
portfolio.columns

Index(['reward', 'difficulty', 'duration', 'offer_type', 'id', 'email',
       'mobile', 'social', 'web'],
      dtype='object')

### profile

* Drop missing values.

In [25]:
profile.dropna(subset=['gender', 'income'], inplace=True)

In [26]:
#Checking for null values
profile.isna().sum()

gender              0
age                 0
id                  0
became_member_on    0
income              0
dtype: int64

### transcript

* Divide the dataset in two according to the criterion of being an offer or amount.

In [27]:
# Visual check of the dataset
transcript.head()

,person,event,value,time
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,{'offer id': '9b98b8c7a33c4b65b9aebfe6a799e6d9'},0
1,a03223e636434f42ac4c3df47e8bac43,offer received,{'offer id': '0b1e1539f2cc45b7b9fa7c272da2e1d7'},0
2,e2127556f4f64592b11af22de27a7932,offer received,{'offer id': '2906b810c7d4411798c6938adc9daaa5'},0
3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,{'offer id': 'fafdcd668e3743c1bb461111dcafc2a4'},0
4,68617ca6246f4fbc85e91a2a49552598,offer received,{'offer id': '4d5c57ea9a6940dd891ad53e9dbe8da0'},0

In [28]:
# Visual check of the dataset
transactions = transcript.copy().query('event == "transaction"')
transactions.head()

,person,event,value,time
12654,02c083884c7d45b39cc68e1314fec56c,transaction,{'amount': 0.8300000000000001},0
12657,9fa9ae8f57894cc9a3b8a9bbe0fc1b2f,transaction,{'amount': 34.56},0
12659,54890f68699049c2a04d415abc25e717,transaction,{'amount': 13.23},0
12670,b2f1cd155b864803ad8334cdf13c4bd2,transaction,{'amount': 19.51},0
12671,fe97aa22dd3e48c8b143116a8403dd52,transaction,{'amount': 18.97},0

In [29]:
# Visual check of the dataset
offers = transcript.copy().query('event != "transaction"')
offers.head()

,person,event,value,time
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,{'offer id': '9b98b8c7a33c4b65b9aebfe6a799e6d9'},0
1,a03223e636434f42ac4c3df47e8bac43,offer received,{'offer id': '0b1e1539f2cc45b7b9fa7c272da2e1d7'},0
2,e2127556f4f64592b11af22de27a7932,offer received,{'offer id': '2906b810c7d4411798c6938adc9daaa5'},0
3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,{'offer id': 'fafdcd668e3743c1bb461111dcafc2a4'},0
4,68617ca6246f4fbc85e91a2a49552598,offer received,{'offer id': '4d5c57ea9a6940dd891ad53e9dbe8da0'},0

### transactions

The value column is a string that must be formatted to match the discount.
Create column for the discount amount.

In [30]:
transactions['amount'] = transactions['value'].apply(lambda x: list(x.values())[0])

In [31]:
transactions.drop('value', axis=1, inplace=True)

In [32]:
# Visual check of the dataset
transactions.head()

                                 person        event  time  amount
12654  02c083884c7d45b39cc68e1314fec56c  transaction     0    0.83
12657  9fa9ae8f57894cc9a3b8a9bbe0fc1b2f  transaction     0   34.56
12659  54890f68699049c2a04d415abc25e717  transaction     0   13.23
12670  b2f1cd155b864803ad8334cdf13c4bd2  transaction     0   19.51
12671  fe97aa22dd3e48c8b143116a8403dd52  transaction     0   18.97

### offers

The value column is a string that must be formatted to match the offer id.
Create column for the offer id.

In [33]:
offers['offer_id'] = offers['value'].apply(lambda x: list(x.values())[0])

In [34]:
offers.drop('value', axis=1, inplace=True)

In [35]:
# Visual check of the dataset
offers.head()

,person,event,time,offer_id
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,0,9b98b8c7a33c4b65b9aebfe6a799e6d9
1,a03223e636434f42ac4c3df47e8bac43,offer received,0,0b1e1539f2cc45b7b9fa7c272da2e1d7
2,e2127556f4f64592b11af22de27a7932,offer received,0,2906b810c7d4411798c6938adc9daaa5
3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,0,fafdcd668e3743c1bb461111dcafc2a4
4,68617ca6246f4fbc85e91a2a49552598,offer received,0,4d5c57ea9a6940dd891ad53e9dbe8da0

In [36]:
offers['offer_id'].value_counts()

fafdcd668e3743c1bb461111dcafc2a4    20241
2298d6c36e964ae4a3e7e9706d1fb8c2    20139
f19421c1d4aa40978ebb69ca19b0e20d    19131
4d5c57ea9a6940dd891ad53e9dbe8da0    18222
ae264e3637204a6fb9bb56bc8210ddfd    18062
9b98b8c7a33c4b65b9aebfe6a799e6d9    16202
2906b810c7d4411798c6938adc9daaa5    15767
5a8bc65990b245e5a138643cd4eb9837    14305
0b1e1539f2cc45b7b9fa7c272da2e1d7    13751
3f207df678b143eea3cee63160fa8bed    11761
Name: offer_id, dtype: int64

## Tidiness

### transactions

In [37]:
# Dataset dimensions
transactions.shape

(138953, 4)

In [38]:
#Join datasets transactions and person
transactions = pd.merge(transactions, profile.copy(), left_on='person', right_on='id')
transactions

,person,event,time,amount,gender,age,id,became_member_on,income
0,02c083884c7d45b39cc68e1314fec56c,transaction,0,0.83,F,20,02c083884c7d45b39cc68e1314fec56c,20160711,30000.0
1,02c083884c7d45b39cc68e1314fec56c,transaction,6,1.44,F,20,02c083884c7d45b39cc68e1314fec56c,20160711,30000.0
2,02c083884c7d45b39cc68e1314fec56c,transaction,12,4.56,F,20,02c083884c7d45b39cc68e1314fec56c,20160711,30000.0
3,02c083884c7d45b39cc68e1314fec56c,transaction,84,1.53,F,20,02c083884c7d45b39cc68e1314fec56c,20160711,30000.0
4,02c083884c7d45b39cc68e1314fec56c,transaction,90,0.50,F,20,02c083884c7d45b39cc68e1314fec56c,20160711,30000.0
...,...,...,...,...,...,...,...,...,...
123952,aabc3d56a2ea4446bef4c3f9eec8ab72,transaction,714,14.68,F,72,aabc3d56a2ea4446bef4c3f9eec8ab72,20180318,74000.0
123953,448dabde725040978b8a247a20bac126,transaction,714,3.19,M,50,448dabde725040978b8a247a20bac126,20180107,60000.0
123954,7718656997f3453db0f5aeca9cd35240,transaction,714,15.35,F,73,7718656997f3453db0f5aeca9cd35240,20180501,65000.0
123955,54463e5d95124b7fb3133fc1eae71952,transaction,714,0.76,M,42,54463e5d95124b7fb3133fc1eae71952,20171104,69000.0
123956,0c027f5f34dd4b9eba0a25785c611273,transaction,714,11.44,M,56,0c027f5f34dd4b9eba0a25785c611273,20171024,61000.0

In [39]:
transactions.drop('id', axis=1, inplace=True)

In [40]:
transactions.drop_duplicates(keep='first', inplace=True)

In [41]:
assert transactions.duplicated().sum() == 0

In [42]:
# Visual check of the dataset
transactions.sample()

,person,event,time,amount,gender,age,became_member_on,income
46319,ddcaa181de424304ac789c075fb57207,transaction,36,17.27,F,42,20170729,71000.0

In [43]:
# Saving dataset in csv file
transactions.to_csv('data/transactions.csv', index=False)

### offers

In [44]:
# Dataset dimensions
portfolio.shape

(10, 9)

In [45]:
offers.shape

(167581, 4)

In [46]:
# Visual check of the dataset
offers.head(11)

,person,event,time,offer_id
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,0,9b98b8c7a33c4b65b9aebfe6a799e6d9
1,a03223e636434f42ac4c3df47e8bac43,offer received,0,0b1e1539f2cc45b7b9fa7c272da2e1d7
2,e2127556f4f64592b11af22de27a7932,offer received,0,2906b810c7d4411798c6938adc9daaa5
3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,0,fafdcd668e3743c1bb461111dcafc2a4
4,68617ca6246f4fbc85e91a2a49552598,offer received,0,4d5c57ea9a6940dd891ad53e9dbe8da0
5,389bc3fa690240e798340f5a15918d5c,offer received,0,f19421c1d4aa40978ebb69ca19b0e20d
6,c4863c7985cf408faee930f111475da3,offer received,0,2298d6c36e964ae4a3e7e9706d1fb8c2
7,2eeac8d8feae4a8cad5a6af0499a211d,offer received,0,3f207df678b143eea3cee63160fa8bed
8,aa4862eba776480b8bb9c68455b8c2e1,offer received,0,0b1e1539f2cc45b7b9fa7c272da2e1d7
9,31dda685af34476cad5bc968bdb01c53,offer received,0,0b1e1539f2cc45b7b9fa7c272da2e1d7
10,744d603ef08c4f33af5a61c8c7628d1c,offer received,0,0b1e1539f2cc45b7b9fa7c272da2e1d7

In [47]:
#Join datasets offers and portfolio
offers = pd.merge(offers, portfolio.copy(), left_on='offer_id', right_on='id')
offers.head()

,person,event,time,offer_id,reward,difficulty,duration,offer_type,id,email,mobile,social,web
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,0,9b98b8c7a33c4b65b9aebfe6a799e6d9,5,5,7,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9,1,1,0,1
1,ebe7ef46ea6f4963a7dd49f501b26779,offer received,0,9b98b8c7a33c4b65b9aebfe6a799e6d9,5,5,7,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9,1,1,0,1
2,f082d80f0aac47a99173ba8ef8fc1909,offer received,0,9b98b8c7a33c4b65b9aebfe6a799e6d9,5,5,7,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9,1,1,0,1
3,c0d210398dee4a0895b24444a5fcd1d2,offer received,0,9b98b8c7a33c4b65b9aebfe6a799e6d9,5,5,7,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9,1,1,0,1
4,57dd18ec5ddc46828afb81ec5977bef2,offer received,0,9b98b8c7a33c4b65b9aebfe6a799e6d9,5,5,7,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9,1,1,0,1

In [48]:
offers.drop('id', axis=1, inplace=True)

In [49]:
#Join datasets offers e person:
offers = pd.merge(offers, profile.copy(), left_on='person', right_on='id')
offers.head()

,person,event,time,offer_id,reward,difficulty,duration,offer_type,email,mobile,social,web,gender,age,id,became_member_on,income
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,0,9b98b8c7a33c4b65b9aebfe6a799e6d9,5,5,7,bogo,1,1,0,1,F,75,78afa995795e4d85b5d9ceeca43f5fef,20170509,100000.0
1,78afa995795e4d85b5d9ceeca43f5fef,offer viewed,6,9b98b8c7a33c4b65b9aebfe6a799e6d9,5,5,7,bogo,1,1,0,1,F,75,78afa995795e4d85b5d9ceeca43f5fef,20170509,100000.0
2,78afa995795e4d85b5d9ceeca43f5fef,offer completed,132,9b98b8c7a33c4b65b9aebfe6a799e6d9,5,5,7,bogo,1,1,0,1,F,75,78afa995795e4d85b5d9ceeca43f5fef,20170509,100000.0
3,78afa995795e4d85b5d9ceeca43f5fef,offer received,504,f19421c1d4aa40978ebb69ca19b0e20d,5,5,5,bogo,1,1,1,1,F,75,78afa995795e4d85b5d9ceeca43f5fef,20170509,100000.0
4,78afa995795e4d85b5d9ceeca43f5fef,offer completed,510,f19421c1d4aa40978ebb69ca19b0e20d,5,5,5,bogo,1,1,1,1,F,75,78afa995795e4d85b5d9ceeca43f5fef,20170509,100000.0

In [50]:
offers.drop('id', axis=1, inplace=True)

In [51]:
offers.drop_duplicates(keep='first', inplace=True)

In [52]:
assert offers.duplicated().sum() == 0

In [53]:
# Visual check of the dataset
offers.sample()

,person,event,time,offer_id,reward,difficulty,duration,offer_type,email,mobile,social,web,gender,age,became_member_on,income
12817,da6f105d4db14af491cc76ddf73ae2da,offer viewed,624,5a8bc65990b245e5a138643cd4eb9837,0,0,3,informational,1,1,1,0,F,21,20171207,60000.0

In [54]:
# Saving dataset in csv file
offers.to_csv('data/offers.csv', index=False)